#include <stdio.h>

//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//原本a是上面这个数，但是因为char类型，使用会发生截断
//	//00000011
//	char b = 127;
//	char c = a + b;
//	//b同理
//	//但是在计算时会发生整形提升
//	//即补符号位数字，增加数据a/b的类型转换为int类型
//	//即a变回00000000000000000000000000000011
//	//00000000000000000000000000000011-a
//	//00000000000000000000000001111111-b
//	//00000000000000000000000010000010
//	printf("c = %d\n", c);
//	//因为c为char类型所以c得到
//	//10000010
//	//但是打印时c又要返回int类型，因为c符号位为1，所以
//	//11111111111111111111111110000010
//	//该数为负数，且运算当中为补码最后转换为-126
//	return 0;
//}

//int main()
//{
//	char a = 0xb6;//10110110发生整形提升数值变换
//	short b = 0xb600;//1011011000000000
//	int c = 0xb6000000;//10110110000000000000000000000000
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//}

int main()
{
	char c = 1;
	printf("%u\n", sizeof(c));
	printf("%u\n", sizeof(+c));//取正，发生了运算所以提升为int类型，即4个字节
	printf("%u\n", sizeof(!c));
	return 0;
}
